uliano/brio/brio/ch32vx03/device.hpp
/*
 * device.hpp
 *
 * The silicon's own register map, in this stratum's words. Like the
 * CH32V00x and unlike every other 32-bit family here, this target
 * compiles with NO VENDOR HEADER: WCH ships its register definitions
 * inside the EVT package, whose licence is written for software running
 * on WCH parts, so the map lives here, read off the documents of record
 * (CH32F/V20x_V30x_V31x reference manual V2.3, the CH32V203 datasheet
 * V2.8, the CH32V303/305/307/317 datasheet V3.5 and the QingKe V4
 * microprocessor manual V1.1) and answerable to them.
 *
 * WHAT THAT COSTS. There is no device header to ask which instances
 * exist, so per-part variability has to be STATED: the build names the
 * part (cmake/ch32vx03-parts.cmake), this file asks that definition ONCE
 * and includes the part's own table from parts/, and every driver reads
 * the facts as `device::` constexpr values - the memories, the bonded
 * pins of each port, the instances, the device class. Thirteen parts
 * are the family: the nine CH32V203 of their datasheet and the four
 * CH32V303 of theirs.
 *
 * THE MANUAL IS FOUR FAMILIES WIDE. Its chapters cover the CH32F20x, the
 * CH32V20x, the CH32V30x and the CH32V31x together, and a register
 * description that names a class (their D6, D8, D8C, D8W) is making a
 * statement about SOME of them. Three of those classes are this
 * stratum's: the CH32V203 is CH32V20x_D6 for every part up to the C8
 * and CH32V20x_D8 for the RB, and the CH32V303 is CH32V30x_D8 (the
 * manual's "Specific classification abbreviations"). Where a field
 * belongs to another class it is not spelled here at all; where it
 * belongs to one of ours, the comment says which. A driver asks a FACT
 * of the part - how many channels, whether a block exists - and asks
 * the class itself only where the manual's note is a list of classes
 * and nothing else answers.
 *
 * Register STRUCTS mirror the chapter's own field names and order, so a
 * reader can hold the manual beside the code. They are the only place in
 * the stratum where an address appears as a number.
 */

#pragma once

#include <stdint.h>

namespace brio {

// ---- the buses (RM 1.3, figure 1-11) --------------------------------------
// PB1 (the manual's "APB1" register names) at 0x40000000, PB2 at
// 0x40010000, HB at 0x40020000, and the USBFS block alone off in its own
// window at 0x50000000.
inline constexpr uint32_t pb1_base   = 0x40000000UL;
inline constexpr uint32_t pb2_base   = 0x40010000UL;
inline constexpr uint32_t hb_base    = 0x40020000UL;
inline constexpr uint32_t usbfs_base = 0x50000000UL;

/// WCH's own division of the family, which the reference manual keys its
/// chapters and many of its registers by ("Specific classification
/// abbreviations"). Every part file states which one it is; the CH32V20x_D8W,
/// the CH32V30x_D8C and the CH32V31x_D8C are other silicon and not here.
enum class DeviceClass : uint8_t {
    v20x_d6,   ///< CH32V20x_D6: the CH32V203F6/F8/G6/G8/K6/K8/C6/C8
    v20x_d8,   ///< CH32V20x_D8: the CH32V203RB
    v30x_d8,   ///< CH32V30x_D8: the CH32V303CB/RB/RC/VC
};

} // namespace brio

// ---- the part -------------------------------------------------------------
// The one place the build's part definition is asked (the file header).
#if defined(CH32V203F6)
#include "ch32vx03/parts/ch32v203f6.hpp"
#elif defined(CH32V203F8)
#include "ch32vx03/parts/ch32v203f8.hpp"
#elif defined(CH32V203G6)
#include "ch32vx03/parts/ch32v203g6.hpp"
#elif defined(CH32V203G8)
#include "ch32vx03/parts/ch32v203g8.hpp"
#elif defined(CH32V203K6)
#include "ch32vx03/parts/ch32v203k6.hpp"
#elif defined(CH32V203K8)
#include "ch32vx03/parts/ch32v203k8.hpp"
#elif defined(CH32V203C6)
#include "ch32vx03/parts/ch32v203c6.hpp"
#elif defined(CH32V203C8)
#include "ch32vx03/parts/ch32v203c8.hpp"
#elif defined(CH32V203RB)
#include "ch32vx03/parts/ch32v203rb.hpp"
#elif defined(CH32V303CB)
#include "ch32vx03/parts/ch32v303cb.hpp"
#elif defined(CH32V303RB)
#include "ch32vx03/parts/ch32v303rb.hpp"
#elif defined(CH32V303RC)
#include "ch32vx03/parts/ch32v303rc.hpp"
#elif defined(CH32V303VC)
#include "ch32vx03/parts/ch32v303vc.hpp"
#else
#error "brio ch32vx03: the build must define the part (ch32vx03/cmake/ch32vx03-parts.cmake derives it from CH32VX03_MCU), and brio/ch32vx03/parts/ must hold its table"
#endif

namespace brio {

// ---- RCC (RM ch. 3) -------------------------------------------------------
struct RccRegs {
    volatile uint32_t CTLR;       ///< 0x00 clock control: HSI, HSE, PLL
    volatile uint32_t CFGR0;      ///< 0x04 SW/SWS, the prescalers, the PLL, MCO
    volatile uint32_t INTR;       ///< 0x08 clock interrupt flags and enables
    volatile uint32_t PB2PRSTR;   ///< 0x0c PB2 peripheral reset
    volatile uint32_t PB1PRSTR;   ///< 0x10 PB1 peripheral reset
    volatile uint32_t HBPCENR;    ///< 0x14 HB clock enables (DMA, SRAM, CRC, USBFS)
    volatile uint32_t PB2PCENR;   ///< 0x18 PB2 clock enables (AFIO, ports, USART1, ...)
    volatile uint32_t PB1PCENR;   ///< 0x1c PB1 clock enables
    volatile uint32_t BDCTLR;     ///< 0x20 the backup domain: LSE, the RTC's source
    volatile uint32_t RSTSCKR;    ///< 0x24 reset causes, LSI
    volatile uint32_t HBRSTR;     ///< 0x28 HB peripheral reset
    volatile uint32_t CFGR2;      ///< 0x2c the second configuration register
};

inline RccRegs* rcc() { return reinterpret_cast<RccRegs*>(hb_base + 0x1000); }

/// RCC_CTLR (3.4.1)
inline constexpr uint32_t rcc_hsion        = 1UL << 0;
inline constexpr uint32_t rcc_hsirdy       = 1UL << 1;
inline constexpr uint32_t rcc_hsitrim_mask = 0x1FUL << 3;   ///< the user trim, 16 = centre
inline constexpr uint32_t rcc_hsical_mask  = 0xFFUL << 8;   ///< the factory calibration, read-only
inline constexpr uint32_t rcc_hseon        = 1UL << 16;
inline constexpr uint32_t rcc_hserdy       = 1UL << 17;
inline constexpr uint32_t rcc_hsebyp       = 1UL << 18;     ///< an external clock, not a crystal
inline constexpr uint32_t rcc_csson        = 1UL << 19;     ///< HSE failure detection (needs HSE)
inline constexpr uint32_t rcc_pllon        = 1UL << 24;
inline constexpr uint32_t rcc_pllrdy       = 1UL << 25;

/// The high-speed root every part boots on: the 8 MHz factory-trimmed
/// RC. The LOW-speed one is a part fact and not a family one - the
/// CH32V203RB's is the 32 kHz RC where the rest of the series carries
/// the 40 kHz one - so its rate is device::lsi_min_hz / lsi_typ_hz /
/// lsi_max_hz, nominal in all three because the spread is wide and
/// anything timed by it is measured.
inline constexpr uint32_t hsi_hz = 8'000'000UL;

