uliano/brio/brio/ch32vx03/device.hpp
/// RCC_CFGR0 (3.4.2)
inline constexpr uint32_t rcc_sw_mask       = 0x3UL << 0;
inline constexpr uint32_t rcc_sw_hsi        = 0x0UL << 0;
inline constexpr uint32_t rcc_sw_hse        = 0x1UL << 0;
inline constexpr uint32_t rcc_sw_pll        = 0x2UL << 0;
inline constexpr uint32_t rcc_sws_mask      = 0x3UL << 2;
inline constexpr uint32_t rcc_sws_hsi       = 0x0UL << 2;
inline constexpr uint32_t rcc_sws_hse       = 0x1UL << 2;
inline constexpr uint32_t rcc_sws_pll       = 0x2UL << 2;
inline constexpr uint32_t rcc_hpre_mask     = 0xFUL << 4;    ///< HB: 0xxx none, 1000 /2 .. 1111 /512
inline constexpr uint32_t rcc_ppre1_mask    = 0x7UL << 8;    ///< PB1: 0xx none, 100 /2 .. 111 /16
inline constexpr uint32_t rcc_ppre1_shift   = 8;
inline constexpr uint32_t rcc_ppre2_mask    = 0x7UL << 11;   ///< PB2, same encoding
inline constexpr uint32_t rcc_ppre2_shift   = 11;
inline constexpr uint32_t rcc_adcpre_mask   = 0x3UL << 14;   ///< PB2 /2 /4 /6 /8, ADC clock <= 14 MHz
inline constexpr uint32_t rcc_adcpre_shift  = 14;
inline constexpr uint32_t rcc_pllsrc        = 1UL << 16;     ///< 0 the HSI, 1 the HSE
inline constexpr uint32_t rcc_pllxtpre      = 1UL << 17;     ///< the HSE halved into the PLL
inline constexpr uint32_t rcc_pllmul_mask   = 0xFUL << 18;
inline constexpr uint32_t rcc_pllmul_shift  = 18;
inline constexpr uint32_t rcc_usbpre_mask   = 0x3UL << 22;   ///< the PLL /1 /2 /3 for USB's 48 MHz
inline constexpr uint32_t rcc_usbpre_shift  = 22;
/// The clock output's source field. WHICH codes it takes is the clock
/// chapter's (brio::McoSource), because four of the eight belong to
/// other device classes.
inline constexpr uint32_t rcc_mco_mask      = 0xFUL << 24;
/// The two bits above the MCO field. ADCDUTY is every class's; ETHPRE
/// belongs to the classes that carry an Ethernet MAC, the CH32V203RB
/// alone here (device::has_ethernet).
inline constexpr uint32_t rcc_ethpre        = 1UL << 28;
/// ADC_DUTY_SEL: the CH32V30x_D8's (and on lots whose penultimate sixth
/// digit is not zero, 3.4.2's note) - 0 a 50 % duty, 1 a 75 % one.
inline constexpr uint32_t rcc_adc_duty_sel  = 1UL << 30;
inline constexpr uint32_t rcc_adcduty       = 1UL << 31;   ///< 1: the ADC clock's low level is longer

/// PLLMUL codes. The ladder is x2..x16 in order and then x18 - the one
/// code that is not its own index plus two, and the one that reaches
/// this family's ceiling from the 8 MHz HSI (3.4.2, CH32V20x_D6/D8).
inline constexpr uint32_t rcc_pllmul_code(uint32_t mul) {
    return mul == 18 ? 0xFUL : (mul - 2);
}
inline constexpr uint32_t rcc_pllmul_of(uint32_t code) {
    return code == 0xF ? 18UL : (code + 2);
}

/// RCC_INTR (3.4.3): the ready flags, their enables, the write-one clears.
inline constexpr uint32_t rcc_lsirdyf  = 1UL << 0;
inline constexpr uint32_t rcc_lserdyf  = 1UL << 1;
inline constexpr uint32_t rcc_hsirdyf  = 1UL << 2;
inline constexpr uint32_t rcc_hserdyf  = 1UL << 3;
inline constexpr uint32_t rcc_pllrdyf  = 1UL << 4;
inline constexpr uint32_t rcc_cssf     = 1UL << 7;
inline constexpr uint32_t rcc_lsirdyie = 1UL << 8;
inline constexpr uint32_t rcc_lserdyie = 1UL << 9;
inline constexpr uint32_t rcc_hsirdyie = 1UL << 10;
inline constexpr uint32_t rcc_hserdyie = 1UL << 11;
inline constexpr uint32_t rcc_pllrdyie = 1UL << 12;
inline constexpr uint32_t rcc_lsirdyc  = 1UL << 16;
inline constexpr uint32_t rcc_lserdyc  = 1UL << 17;
inline constexpr uint32_t rcc_hsirdyc  = 1UL << 18;
inline constexpr uint32_t rcc_hserdyc  = 1UL << 19;
inline constexpr uint32_t rcc_pllrdyc  = 1UL << 20;
inline constexpr uint32_t rcc_cssc     = 1UL << 23;
/// The enables as one field. The flags are read-only and the clears
/// write-only, so a verb that clears one flag writes
/// (INTR & rcc_intr_enables) | <the clear bit> and disarms nothing.
inline constexpr uint32_t rcc_intr_enables = rcc_lsirdyie | rcc_lserdyie | rcc_hsirdyie |
                                             rcc_hserdyie | rcc_pllrdyie;
inline constexpr uint32_t rcc_intr_flags   = rcc_lsirdyf | rcc_lserdyf | rcc_hsirdyf |
                                             rcc_hserdyf | rcc_pllrdyf | rcc_cssf;

/// RCC_RSTSCKR (3.4.10): the LSI lives with the reset flags.
inline constexpr uint32_t rcc_lsion  = 1UL << 0;
inline constexpr uint32_t rcc_lsirdy = 1UL << 1;

/// RCC_HBPCENR (3.4.6). The second DMA controller, the FSMC, the RNG and
/// the SDIO host are the CH32V303's (device::dma_controller_count,
/// has_fsmc, has_rng, has_sdio); on a part without the block the bit is
/// a gate to nothing.
inline constexpr uint32_t rcc_hb_dma1  = 1UL << 0;
inline constexpr uint32_t rcc_hb_dma2  = 1UL << 1;
inline constexpr uint32_t rcc_hb_sram  = 1UL << 2;
inline constexpr uint32_t rcc_hb_crc   = 1UL << 6;
inline constexpr uint32_t rcc_hb_fsmc  = 1UL << 8;
inline constexpr uint32_t rcc_hb_rng   = 1UL << 9;
inline constexpr uint32_t rcc_hb_sdio  = 1UL << 10;
inline constexpr uint32_t rcc_hb_usbfs = 1UL << 12;   ///< the host/device controller (OTG_FS)

/// RCC_PB2PCENR (3.4.7): one bit per peripheral on the PB2 bus.
inline constexpr uint32_t rcc_pb2_afio   = 1UL << 0;
inline constexpr uint32_t rcc_pb2_gpioa  = 1UL << 2;
inline constexpr uint32_t rcc_pb2_gpiob  = 1UL << 3;
inline constexpr uint32_t rcc_pb2_gpioc  = 1UL << 4;
inline constexpr uint32_t rcc_pb2_gpiod  = 1UL << 5;
inline constexpr uint32_t rcc_pb2_gpioe  = 1UL << 6;
inline constexpr uint32_t rcc_pb2_adc1   = 1UL << 9;
inline constexpr uint32_t rcc_pb2_adc2   = 1UL << 10;
inline constexpr uint32_t rcc_pb2_tim1   = 1UL << 11;
inline constexpr uint32_t rcc_pb2_spi1   = 1UL << 12;
inline constexpr uint32_t rcc_pb2_tim8   = 1UL << 13;   ///< TIM8..TIM10: the CH32V303RC and VC
inline constexpr uint32_t rcc_pb2_usart1 = 1UL << 14;
inline constexpr uint32_t rcc_pb2_tim9   = 1UL << 19;
inline constexpr uint32_t rcc_pb2_tim10  = 1UL << 20;

/// RCC_PB1PCENR (3.4.8). PWR and BKP are two of them: their registers
/// answer rubbish until their gates are open.
inline constexpr uint32_t rcc_pb1_tim2   = 1UL << 0;
inline constexpr uint32_t rcc_pb1_tim3   = 1UL << 1;
inline constexpr uint32_t rcc_pb1_tim4   = 1UL << 2;
inline constexpr uint32_t rcc_pb1_tim5   = 1UL << 3;    ///< where device::has_tim5
inline constexpr uint32_t rcc_pb1_tim6   = 1UL << 4;    ///< the two basic timers
inline constexpr uint32_t rcc_pb1_tim7   = 1UL << 5;    ///< (device::basic_timer_instances)
inline constexpr uint32_t rcc_pb1_uart6  = 1UL << 6;    ///< UART5..8: the CH32V303RC and VC
inline constexpr uint32_t rcc_pb1_uart7  = 1UL << 7;
inline constexpr uint32_t rcc_pb1_uart8  = 1UL << 8;
inline constexpr uint32_t rcc_pb1_wwdg   = 1UL << 11;
inline constexpr uint32_t rcc_pb1_spi2   = 1UL << 14;
inline constexpr uint32_t rcc_pb1_spi3   = 1UL << 15;   ///< the CH32V303RC and VC
inline constexpr uint32_t rcc_pb1_usart2 = 1UL << 17;
inline constexpr uint32_t rcc_pb1_usart3 = 1UL << 18;
inline constexpr uint32_t rcc_pb1_uart4  = 1UL << 19;
inline constexpr uint32_t rcc_pb1_uart5  = 1UL << 20;
inline constexpr uint32_t rcc_pb1_i2c1   = 1UL << 21;
inline constexpr uint32_t rcc_pb1_i2c2   = 1UL << 22;
inline constexpr uint32_t rcc_pb1_usbd   = 1UL << 23;   ///< the full-speed device controller
inline constexpr uint32_t rcc_pb1_can1   = 1UL << 25;
inline constexpr uint32_t rcc_pb1_bkp    = 1UL << 27;
inline constexpr uint32_t rcc_pb1_pwr    = 1UL << 28;
inline constexpr uint32_t rcc_pb1_dac    = 1UL << 29;   ///< every CH32V303 (device::has_dac)

// ---- the blocks the CH32V303 adds (RM 1.2, figure 1-13) -------------------
// Where they answer, for the chapters that will drive them. A block this
// part has not got is a fact of parts/<part>.hpp; its address is still an
// address and nothing here reaches it. TIM5 is tim.hpp's (tim5_base), the
// four serial ports above UART4 are usart_base_for()'s, and the
// operational amplifiers' one register is opa.hpp's (opa_base), the same
// word on every class.
inline constexpr uint32_t dma2_base       = hb_base + 0x0400;    ///< 0x40020400
inline constexpr uint32_t rng_base        = hb_base + 0x3C00;    ///< 0x40023C00
inline constexpr uint32_t tim6_base       = pb1_base + 0x1000;
inline constexpr uint32_t tim7_base       = pb1_base + 0x1400;
inline constexpr uint32_t spi3_base       = pb1_base + 0x3C00;   ///< SPI3/I2S3
inline constexpr uint32_t dac_base        = pb1_base + 0x7400;
inline constexpr uint32_t tim8_base       = pb2_base + 0x3400;
inline constexpr uint32_t tim9_base       = pb2_base + 0x4C00;
inline constexpr uint32_t tim10_base      = pb2_base + 0x5000;
inline constexpr uint32_t sdio_base       = pb2_base + 0x8000;   ///< 0x40018000
inline constexpr uint32_t fsmc_bank1_base = 0x60000000UL;        ///< NOR/PSRAM, four sub-banks
inline constexpr uint32_t fsmc_bank2_base = 0x70000000UL;        ///< NAND
inline constexpr uint32_t fsmc_regs_base  = 0xA0000000UL;        ///< the controller's registers

