uliano/brio/brio/ch32vx03/device.hpp
/// Interrupt numbers, which on this core ARE the vector table's word
/// indices (QingKe V4 manual 3.2): the word at address 0 is an
/// instruction, the words after it are handler addresses.
///
/// A TABLE PER DEVICE CLASS. Entries up to 57 are every class's; from 58
/// the tail is the CLASS's, not the family's - the reference manual's
/// own table 9-2 is the union of four families (it names USBWakeUp at 58
/// for every class and TIM8 at 59..62, which the CH32V203 has not got),
/// so each tail is stated from the part definition, in the crt
/// (ch32vx03/src/glue/startup_ch32vx03.S) and here, and the two agree
/// word for word. The CH32V20x_D6 ends at 62; the CH32V20x_D8 puts the
/// Ethernet pair between the USBFS pair and UART4 and runs to 69; the
/// CH32V30x_D8 - the CH32V303, whose numbers are WCH's own startup file
/// for the class but for its two wake-ups - moves UART4 to 68, the USBFS
/// controller to 83 and its wake-up to 84, adds TIM5..TIM10, UART5..8,
/// SPI3, the RNG, the SDIO host and DMA2's eleven channels, and has no
/// eighth DMA1 channel. The USB wake-up at 58 and the USBFS one at 84
/// are the silicon's and not that file's, which leaves both words zero:
/// EXTI line 18's software trigger pends PFIC line 58 and line 20's
/// pends 84 (measured on a CH32V303VC). A line a class has not got is
/// irq_none.
enum class Irq : uint8_t {
    non_maskable     = 2,
    exception        = 3,
    ecall_machine    = 5,
    ecall_user       = 8,
    breakpoint       = 9,
    systick          = 12,
    software         = 14,
    wwdg             = 16,
    pvd              = 17,
    tamper           = 18,
    rtc              = 19,
    flash            = 20,
    rcc              = 21,
    exti0            = 22,
    exti1            = 23,
    exti2            = 24,
    exti3            = 25,
    exti4            = 26,
    dma1_channel1    = 27,
    dma1_channel2    = 28,
    dma1_channel3    = 29,
    dma1_channel4    = 30,
    dma1_channel5    = 31,
    dma1_channel6    = 32,
    dma1_channel7    = 33,
    adc1_2           = 34,
    usb_hp_can1_tx   = 35,
    usb_lp_can1_rx0  = 36,
    can1_rx1         = 37,
    can1_sce         = 38,
    exti9_5          = 39,
    tim1_brk         = 40,
    tim1_up          = 41,
    tim1_trg_com     = 42,
    tim1_cc          = 43,
    tim2             = 44,
    tim3             = 45,
    tim4             = 46,
    i2c1_ev          = 47,
    i2c1_er          = 48,
    i2c2_ev          = 49,
    i2c2_er          = 50,
    spi1             = 51,
    spi2             = 52,
    usart1           = 53,
    usart2           = 54,
    usart3           = 55,
    exti15_10        = 56,
    rtc_alarm        = 57,
    // ---- the tails (device::vector_count) -------------------------------
    //                               D6        D8        V30x_D8
    usb_wakeup       = irq_by_class(58,       58,       58),
    usbfs            = irq_by_class(59,       59,       83),
    usbfs_wakeup     = irq_by_class(60,       60,       84),
    eth              = irq_by_class(irq_none, 61,       irq_none),
    eth_wakeup       = irq_by_class(irq_none, 62,       irq_none),
    tim5             = irq_by_class(irq_none, 65,       66),
    uart4            = irq_by_class(61,       66,       68),
    dma1_channel8    = irq_by_class(62,       67,       irq_none),
    osc32k_cal       = irq_by_class(irq_none, 68,       irq_none),
    osc32k_wakeup    = irq_by_class(irq_none, 69,       irq_none),
    tim8_brk         = irq_by_class(irq_none, irq_none, 59),
    tim8_up          = irq_by_class(irq_none, irq_none, 60),
    tim8_trg_com     = irq_by_class(irq_none, irq_none, 61),
    tim8_cc          = irq_by_class(irq_none, irq_none, 62),
    rng              = irq_by_class(irq_none, irq_none, 63),
    sdio             = irq_by_class(irq_none, irq_none, 65),
    spi3             = irq_by_class(irq_none, irq_none, 67),
    uart5            = irq_by_class(irq_none, irq_none, 69),
    tim6             = irq_by_class(irq_none, irq_none, 70),
    tim7             = irq_by_class(irq_none, irq_none, 71),
    dma2_channel1    = irq_by_class(irq_none, irq_none, 72),
    dma2_channel2    = irq_by_class(irq_none, irq_none, 73),
    dma2_channel3    = irq_by_class(irq_none, irq_none, 74),
    dma2_channel4    = irq_by_class(irq_none, irq_none, 75),
    dma2_channel5    = irq_by_class(irq_none, irq_none, 76),
    uart6            = irq_by_class(irq_none, irq_none, 87),
    uart7            = irq_by_class(irq_none, irq_none, 88),
    uart8            = irq_by_class(irq_none, irq_none, 89),
    tim9_brk         = irq_by_class(irq_none, irq_none, 90),
    tim9_up          = irq_by_class(irq_none, irq_none, 91),
    tim9_trg_com     = irq_by_class(irq_none, irq_none, 92),
    tim9_cc          = irq_by_class(irq_none, irq_none, 93),
    tim10_brk        = irq_by_class(irq_none, irq_none, 94),
    tim10_up         = irq_by_class(irq_none, irq_none, 95),
    tim10_trg_com    = irq_by_class(irq_none, irq_none, 96),
    tim10_cc         = irq_by_class(irq_none, irq_none, 97),
    dma2_channel6    = irq_by_class(irq_none, irq_none, 98),
    dma2_channel7    = irq_by_class(irq_none, irq_none, 99),
    dma2_channel8    = irq_by_class(irq_none, irq_none, 100),
    dma2_channel9    = irq_by_class(irq_none, irq_none, 101),
    dma2_channel10   = irq_by_class(irq_none, irq_none, 102),
    dma2_channel11   = irq_by_class(irq_none, irq_none, 103),
};

/// Whether this part's vector table has the line at all.
constexpr bool irq_exists(Irq line) { return static_cast<uint8_t>(line) != irq_none; }

/// A line named where it is USED: the same Irq back, and a compile error
/// on a part whose device class has no such vector - the static_assert
/// at the use that a silent zero would not be.
template <Irq line>
constexpr Irq irq_present() {
    static_assert(irq_exists(line),
                  "brio ch32vx03: this part's device class has no such interrupt line "
                  "(device.hpp's Irq table, startup_ch32vx03.S's tail)");
    return line;
}

} // namespace brio
